---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopReferencedend
source: html/fb798428-a563-aba1-e53b-d002c911ebb3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentTopReferencedend Property

"Top Attachment Referenced End"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentTopReferencedend { get; }
```